# 6 Pamoka: Pandas #2

In [5]:
# !pip3 install pandas
import pandas as pd
import numpy as np

### 1. Trukstami Duomenys

In [6]:
df = pd.DataFrame(np.random.rand(5,6), 
                ['a', 'b', 'c', 'd', 'e'], 
                ['U', 'V', 'W', 'X', 'Y', 'Z'])

In [7]:
df

          U         V         W         X         Y         Z
a  0.922965  0.133949  0.299491  0.221957  0.084694  0.598735
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c  0.016958  0.310164  0.381014  0.816599  0.484805  0.205125
d  0.403751  0.085628  0.384796  0.132179  0.432360  0.026625
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [8]:
table = df[df > 0.15]

In [9]:
table

          U         V         W         X         Y         Z
a  0.922965       NaN  0.299491  0.221957       NaN  0.598735
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c       NaN  0.310164  0.381014  0.816599  0.484805  0.205125
d  0.403751       NaN  0.384796       NaN  0.432360       NaN
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [10]:
table.isnull()

       U      V      W      X      Y      Z
a  False   True  False  False   True  False
b  False  False  False  False  False  False
c   True  False  False  False  False  False
d  False   True  False   True  False   True
e  False  False  False  False  False  False

In [11]:
table.isnull().sum()

U    1
V    2
W    0
X    1
Y    1
Z    1
dtype: int64

In [12]:
False == 0

True

In [13]:
True == 1

True

In [14]:
table['V'].isnull()

a     True
b    False
c    False
d     True
e    False
Name: V, dtype: bool

In [15]:
table['V'].isnull().sum()

2

In [16]:
table.dropna()

          U         V         W         X         Y         Z
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

In [17]:
table.dropna(axis=1)

          W
a  0.299491
b  0.926529
c  0.381014
d  0.384796
e  0.473615

In [18]:
table.dropna(thresh=5)

          U         V         W         X         Y         Z
b  0.372609  0.739499  0.926529  0.784357  0.897677  0.163551
c       NaN  0.310164  0.381014  0.816599  0.484805  0.205125
e  0.547058  0.370504  0.473615  0.619465  0.470644  0.190577

Null reiksmiu uzpildymas

In [19]:
table.fillna('not a null')

            U           V         W           X           Y           Z
a    0.922965  not a null  0.299491    0.221957  not a null    0.598735
b    0.372609    0.739499  0.926529    0.784357    0.897677    0.163551
c  not a null    0.310164  0.381014    0.816599    0.484805    0.205125
d    0.403751  not a null  0.384796  not a null     0.43236  not a null
e    0.547058    0.370504  0.473615    0.619465    0.470644    0.190577

In [23]:
table['X'].mean()

0.61059432744093

`vidutines reiksmes priskyrimas`: norime priskirti vidutine reiksme stulpeliui

In [24]:
table['X'].fillna(value=table['X'].mean())

a    0.221957
b    0.784357
c    0.816599
d    0.610594
e    0.619465
Name: X, dtype: float64

`savo reiksmes priskyrimas`

In [26]:
table['U'].fillna(1.0)

a    0.922965
b    0.372609
c    1.000000
d    0.403751
e    0.547058
Name: U, dtype: float64

## Grupavimas

In [29]:
duomenys = {'Šalis': ['Lietuva',
  'Lietuva',
  'Lietuva',
  'Latvija',
  'Latvija',
  'Latvija',
  'Estija',
  'Estija',
  'Estija'],
 'Miestas': ['Vilnius',
  'Kaunas',
  'Klaipėda',
  'Ryga',
  'Ventspilis',
  'Daugpilis',
  'Talinas',
  'Tartu',
  'Pernu'],
 'Gyv': [541, 287, 147, 716, 43, 105, 400, 101, 46]}

In [30]:
df = pd.DataFrame(duomenys)

In [32]:
df.groupby("Šalis")

In [33]:
df.groupby("Šalis").mean()

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/2358123355.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").mean()

                Gyv
Šalis
Estija   182.333333
Latvija  288.000000
Lietuva  325.000000

In [34]:
df.groupby("Šalis").sum()

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/319958757.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").sum()

         Gyv
Šalis
Estija   547
Latvija  864
Lietuva  975

In [35]:
df.groupby("Šalis").count()

         Miestas  Gyv
Šalis
Estija         3    3
Latvija        3    3
Lietuva        3    3

In [36]:
df.groupby("Šalis").max()

            Miestas  Gyv
Šalis
Estija        Tartu  400
Latvija  Ventspilis  716
Lietuva     Vilnius  541

In [38]:
df.groupby("Šalis").min()

           Miestas  Gyv
Šalis
Estija       Pernu   46
Latvija  Daugpilis   43
Lietuva     Kaunas  147

In [40]:
df.groupby("Šalis").agg({'Miestas': 'count', 'Gyv': 'min'})

         Miestas  Gyv
Šalis
Estija         3   46
Latvija        3   43
Lietuva        3  147

In [41]:
df.groupby("Šalis").sum().loc['Lietuva']

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/1413998473.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Šalis").sum().loc['Lietuva']

Gyv    975
Name: Lietuva, dtype: int64

In [42]:
df.groupby("Šalis").describe()

          Gyv
        count        mean         std    min    25%    50%    75%    max
Šalis
Estija    3.0  182.333333  190.500219   46.0   73.5  101.0  250.5  400.0
Latvija   3.0  288.000000  371.952954   43.0   74.0  105.0  410.5  716.0
Lietuva   3.0  325.000000  199.729818  147.0  217.0  287.0  414.0  541.0

In [43]:
df.groupby("Šalis").describe().transpose()

Šalis          Estija     Latvija     Lietuva
Gyv count    3.000000    3.000000    3.000000
    mean   182.333333  288.000000  325.000000
    std    190.500219  371.952954  199.729818
    min     46.000000   43.000000  147.000000
    25%     73.500000   74.000000  217.000000
    50%    101.000000  105.000000  287.000000
    75%    250.500000  410.500000  414.000000
    max    400.000000  716.000000  541.000000

In [44]:
df.groupby("Šalis").describe().transpose()['Estija']

Gyv  count      3.000000
     mean     182.333333
     std      190.500219
     min       46.000000
     25%       73.500000
     50%      101.000000
     75%      250.500000
     max      400.000000
Name: Estija, dtype: float64

## Dataframe jungimas

In [78]:
df1 = df[0:6]

In [79]:
df1

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105

In [80]:
df2 = df[6:]

In [81]:
df2

    Šalis  Miestas  Gyv
6  Estija  Talinas  400
7  Estija    Tartu  101
8  Estija    Pernu   46

`Komentaras`: atsrgiai su duplikatais

In [82]:
pd.concat([df1, df2])    # .drop_duplicates() jeigu potencialiai gali lenta tureti identisku eiluciu
                         # .drop_duplicates(subset='Miestas')

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105
6   Estija     Talinas  400
7   Estija       Tartu  101
8   Estija       Pernu   46

Jungimas is desines

In [86]:
pd.concat([df1, df2], axis=1)

     Šalis     Miestas    Gyv   Šalis  Miestas    Gyv
0  Lietuva     Vilnius  541.0     NaN      NaN    NaN
1  Lietuva      Kaunas  287.0     NaN      NaN    NaN
2  Lietuva    Klaipėda  147.0     NaN      NaN    NaN
3  Latvija        Ryga  716.0     NaN      NaN    NaN
4  Latvija  Ventspilis   43.0     NaN      NaN    NaN
5  Latvija   Daugpilis  105.0     NaN      NaN    NaN
6      NaN         NaN    NaN  Estija  Talinas  400.0
7      NaN         NaN    NaN  Estija    Tartu  101.0
8      NaN         NaN    NaN  Estija    Pernu   46.0

In [90]:
data_right = df2.reset_index(drop=True)

In [91]:
data_right

    Šalis  Miestas  Gyv
0  Estija  Talinas  400
1  Estija    Tartu  101
2  Estija    Pernu   46

In [92]:
pd.concat([df1, data_right], axis=1)

     Šalis     Miestas  Gyv   Šalis  Miestas    Gyv
0  Lietuva     Vilnius  541  Estija  Talinas  400.0
1  Lietuva      Kaunas  287  Estija    Tartu  101.0
2  Lietuva    Klaipėda  147  Estija    Pernu   46.0
3  Latvija        Ryga  716     NaN      NaN    NaN
4  Latvija  Ventspilis   43     NaN      NaN    NaN
5  Latvija   Daugpilis  105     NaN      NaN    NaN

## Join / Merge

In [116]:
key = 'A B C D E F'.split()
df1['key'] = key
# data_right['key'] = key

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/3519981816.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['key'] = key

In [117]:
df1

     Šalis     Miestas  Gyv key
0  Lietuva     Vilnius  541   A
1  Lietuva      Kaunas  287   B
2  Lietuva    Klaipėda  147   C
3  Latvija        Ryga  716   D
4  Latvija  Ventspilis   43   E
5  Latvija   Daugpilis  105   F

In [96]:
df3 = df[2:8]

In [98]:
df3['key'] = key

/var/folders/9h/pxgsfw7n1h1bdydh77wmr1q40000gn/T/ipykernel_16701/1373257844.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['key'] = key

In [105]:
df4 = df3.copy()

In [107]:
df4.columns = ['Šalis', 'City', 'Gyv', 'key']

In [111]:
df4.columns = ['Šalis', 'Miestas', 'Gyv', 'key']

In [118]:
df4

     Šalis     Miestas  Gyv key
2  Lietuva    Klaipėda  147   A
3  Latvija        Ryga  716   B
4  Latvija  Ventspilis   43   C
5  Latvija   Daugpilis  105   D
6   Estija     Talinas  400   E
7   Estija       Tartu  101   F

In [110]:
pd.merge(df1, df4, on='key')

   Šalis_x     Miestas  Gyv_x key  Šalis_y        City  Gyv_y
0  Lietuva     Vilnius    541   A  Lietuva    Klaipėda    147
1  Lietuva      Kaunas    287   B  Latvija        Ryga    716
2  Lietuva    Klaipėda    147   C  Latvija  Ventspilis     43
3  Latvija        Ryga    716   D  Latvija   Daugpilis    105
4  Latvija  Ventspilis     43   E   Estija     Talinas    400
5  Latvija   Daugpilis    105   F   Estija       Tartu    101

Jeigu reiksmes skiriasi

In [114]:
keyX = 'X Y Z D E F'.split()

In [119]:
df4['key'] = keyX

In [120]:
df4

     Šalis     Miestas  Gyv key
2  Lietuva    Klaipėda  147   X
3  Latvija        Ryga  716   Y
4  Latvija  Ventspilis   43   Z
5  Latvija   Daugpilis  105   D
6   Estija     Talinas  400   E
7   Estija       Tartu  101   F

In [126]:
pd.merge(df1, df4, on='key')

   Šalis_x   Miestas_x  Gyv_x key  Šalis_y  Miestas_y  Gyv_y
0  Latvija        Ryga    716   D  Latvija  Daugpilis    105
1  Latvija  Ventspilis     43   E   Estija    Talinas    400
2  Latvija   Daugpilis    105   F   Estija      Tartu    101

In [123]:
pd.merge(df1, df4, on='key', how='outer')

   Šalis_x   Miestas_x  Gyv_x key  Šalis_y   Miestas_y  Gyv_y
0  Lietuva     Vilnius  541.0   A      NaN         NaN    NaN
1  Lietuva      Kaunas  287.0   B      NaN         NaN    NaN
2  Lietuva    Klaipėda  147.0   C      NaN         NaN    NaN
3  Latvija        Ryga  716.0   D  Latvija   Daugpilis  105.0
4  Latvija  Ventspilis   43.0   E   Estija     Talinas  400.0
5  Latvija   Daugpilis  105.0   F   Estija       Tartu  101.0
6      NaN         NaN    NaN   X  Lietuva    Klaipėda  147.0
7      NaN         NaN    NaN   Y  Latvija        Ryga  716.0
8      NaN         NaN    NaN   Z  Latvija  Ventspilis   43.0

In [129]:
df1.join(df4, lsuffix='L', rsuffix='R')

    ŠalisL    MiestasL  GyvL keyL   ŠalisR    MiestasR   GyvR keyR
0  Lietuva     Vilnius   541    A      NaN         NaN    NaN  NaN
1  Lietuva      Kaunas   287    B      NaN         NaN    NaN  NaN
2  Lietuva    Klaipėda   147    C  Lietuva    Klaipėda  147.0    X
3  Latvija        Ryga   716    D  Latvija        Ryga  716.0    Y
4  Latvija  Ventspilis    43    E  Latvija  Ventspilis   43.0    Z
5  Latvija   Daugpilis   105    F  Latvija   Daugpilis  105.0    D

In [130]:
df1

     Šalis     Miestas  Gyv key
0  Lietuva     Vilnius  541   A
1  Lietuva      Kaunas  287   B
2  Lietuva    Klaipėda  147   C
3  Latvija        Ryga  716   D
4  Latvija  Ventspilis   43   E
5  Latvija   Daugpilis  105   F

In [131]:
df4

     Šalis     Miestas  Gyv key
2  Lietuva    Klaipėda  147   X
3  Latvija        Ryga  716   Y
4  Latvija  Ventspilis   43   Z
5  Latvija   Daugpilis  105   D
6   Estija     Talinas  400   E
7   Estija       Tartu  101   F

IMPORT

In [132]:
pd.read_csv("uzduotys/tops/top1-25-1.csv")

,Track.Name,Artist.Name,Genre,Popularity
0,Senorita,Shawn Mendes,canadian pop,79.0
1,China,Anuel AA,reggaeton flow,92.0
2,boyfriend (with Social House),Ariana Grande,dance pop,85.0
3,Beautiful People (feat. Khalid),Ed Sheeran,pop,NaN
4,Goodbyes (Feat. Young Thug),Post Malone,dfw rap,94.0
5,I Don't Care (with Justin Bieber),Ed Sheeran,pop,84.0
6,Ransom,Lil Tecca,trap music,92.0
7,How Do You Sleep?,Sam Smith,pop,90.0
8,Old Town Road - Remix,Lil Nas X,country rap,87.0
9,bad guy,Billie Eilish,electropop,95.0
10,Callaita,Bad Bunny,reggaeton,93.0
11,Loco Contigo (feat. J. Balvin & Tyga),DJ Snake,dance pop,86.0
12,Someone You Loved,Lewis Capaldi,pop,88.0
13,Otro Trago - Remix,Sech,panamanian pop,87.0
14,Money In The Grave (Drake ft. Rick Ross),Drake,canadian hip hop,92.0
15,No Guidance (feat. Drake),Chris Brown,dance pop,82.0
16,LA CANCION,J Balvin,latin,90.0
17,Sunflower - Spider-Man: Into the Spider-Verse,Post Malone,dfw rap,91.0
18,Lalala,Y2K,NaN,88.0
19,Truth Hurts,Lizzo,escape room,91.0
20,Piece Of Your Heart,MEDUZA,pop house,91.0
21,Panini,Lil Nas X,country rap,91.0
22,No Me Conoce - Remix,Jhay Cortez,reggaeton flow,83.0
23,Soltera - Remix,Lunay,latin,91.0
24,bad guy (with Justin Bieber),Billie Eilish,electropop,NaN